---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalService.GetOptions
source: html/492cc7a7-9493-732e-a6a7-fd00b3b85773.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.GetOptions Method

A copy of the options the service was registered with.

## Syntax (C#)
```csharp
public ExternalServiceOptions GetOptions()
```

## Returns
An instance of the options class.

## Remarks
The returned instance is mutable, but any changes
 made there cannot be assigned back to the service.